req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>

    <nfeDistDFeInteresse
      xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeDistribuicaoDFe">

      <nfeDadosMsg>

        <distDFeInt
          xmlns="http://www.portalfiscal.inf.br/nfe"
          versao="1.01">

          <tpAmb>1</tpAmb>
          <CNPJ>34683891000140</CNPJ>

          <distNSU>
            <ultNSU>000000000000000</ultNSU>
          </distNSU>

        </distDFeInt>

      </nfeDadosMsg>
    </nfeDistDFeInteresse>

  </soap:Body>
</soap:Envelope>
